{"ids": [1500231335151087618, 1500207409582772230, 1500187768705720331, 1499811117782249480, 1499778834035617798, 1499505718327750668, 1499475135421628428, 1499461118670123012, 1499431630569619459, 1499430123346534403, 1499418925808898061, 1499395646402428936, 1499188485957296128, 1499157257866649602, 1498870884123267078, 1498859225103179777, 1498855449449357312, 1498854228982435843, 1498851874199506947, 1498850830388236292, 1498850313469673473, 1498848845911969793, 1498846871896342538, 1498845136498868225, 1498780153924751364, 1498744531466035203, 1498661603117522947, 1498490704225517570, 1498385541913616389, 1498374242437586947, 1498299232012447749, 1498111187967434753, 1498083967907647491, 1498059207895097344, 1498035421229502473, 1497613102493413382, 1497302230273126401, 1497249853335691265, 1497242757722783745, 1497242756045058055, 1496986351744520196, 1496911009302331395, 1496670379171094530, 1496670378432868352, 1496670377493340164, 1496670376096673794, 1496620584133971968, 1496605534891433987, 1496569385061916674, 1496260633498640386, 1496150893812760582, 1495785027589844996, 1495431353986342914, 1495431352447127556, 1495149143546900485, 1495063860822396931, 1494815764116914182, 1494732978831904775, 1494399041333047301, 1494091068383580160, 1494060684245671940, 1494039003225600000, 1493978012043431944, 1493808373724327938, 1493664151826321427, 1493664150907723781, 1493664150094024711, 1493664149171232777, 1493664148345044999, 1493664146600177671, 1493645570677907463, 1493369483154628610, 1493323168248967171, 1493273844798398471, 1492254076008116232, 1492233926173147147, 1492181181772845057, 1491869129095233536, 1491594182699491333, 1491497382944690187, 1491477110053130241, 1491434192722599936, 1491434191397208066, 1491434189459456002, 1491231131588444162, 1491213430568546304, 1491172294982795264, 1491118347274317824, 1491118346259267584, 1491096025465241600, 1491065786781384705, 1490832364003495936, 1489994666485374977, 1489761188317704197, 1489721620142907394, 1489685580959166468, 1489639937938972674, 1489624966421172229, 1489445635191365633], "1500231335151087618": {"text": "Thank you to members of Ukrainian San Antonio who met with me to share their stories &amp; fiercely advocate for their nation.\n\nThe crisis in Ukraine is unacceptable. As I work to increase US support for Ukraine &amp; force Putin to end his war, their voices will be at the top of my mind https://t.co/pZz6J8HfJN", "time": "2022-03-05 22:06:37+00:00"}, "1500207409582772230": {"text": "I’m closely monitoring reports of Texan @brittneygriner's detention in Russia. This follows a pattern of Russia wrongly detaining &amp; imprisoning US citizens, including Trevor Reed.\n\nUS citizens are not political pawns. Brittney, Trevor, and other Americans must be safely returned. https://t.co/UsYuS180sm", "time": "2022-03-05 20:31:33+00:00"}, "1500187768705720331": {"text": "This morning, I joined House &amp; Senate colleagues to meet with @ZelenskyyUa about the situation in Ukraine.\n\nUkrainian bravery &amp; resolve stand in stark contrast to Putin's cruelty. Congress is united behind Ukraine &amp; the US will work w/allies to ensure it has the support it needs.", "time": "2022-03-05 19:13:30+00:00"}, "1499811117782249480": {"text": "In TX and most other states, child care workers don’t earn a living wage.\n\nThese folks care for our kids at a key stage in their development &amp; help parents get back to work. By raising their pay, Congress can invest in a more equitable recovery. #COVIDChildCareChallenge https://t.co/M1i8ODBqJA", "time": "2022-03-04 18:16:50+00:00"}, "1499778834035617798": {"text": "In a @HouseForeign hearing last month, @WHAAsstSecty assured me that the @USEmbCuba would soon start visa processing.\n\nThousands of Cubans will now be able to reunite with their families in the US.\n\nI look forward to working with @StateDept on increased engagement with Cuba. https://t.co/ghGB1b1cTw", "time": "2022-03-04 16:08:33+00:00"}, "1499505718327750668": {"text": "Countries that commit war crimes don’t deserve medals.\n\nToday, @RepAnnWagner and I led a bipartisan coalition of members of Congress urging @POTUS to work with our allies to bar Russia from competing in, hosting, or profiting from international sporting events. Read our letter 👇 https://t.co/THHUPUjr6H", "time": "2022-03-03 22:03:17+00:00"}, "1499475135421628428": {"text": "People navigating immigration cases deserve the support of their families and community — not the locked doors of an immigration detention facility.\n\n@POTUS needs to put forward a plan to end Trump-era policies like Title 42 and Remain in Mexico. #CommunitiesNotCages", "time": "2022-03-03 20:01:45+00:00"}, "1499461118670123012": {"text": "Deeply concerned by reports that Paul Rusesabagina's health is rapidly deteriorating in prison. While we focus on atrocities in Ukraine, we cannot forget political prisoners around the world. Rwanda must allow outside medical professionals to examine him now. #FreeRusesabagina", "time": "2022-03-03 19:06:03+00:00"}, "1499431630569619459": {"text": "CNN+ Slammed by Journalist Group for Lack of Latinos: ‘NAHJ Is Appalled’ https://t.co/1mKgVYvG7S", "time": "2022-03-03 17:08:53+00:00"}, "1499430123346534403": {"text": "Welcome back, @SenatorLujan!\n\nThe Senate needs your voice and your spirit. Your friends in the House are cheering for you and the nation is grateful for your return. New Mexico is lucky to have a fighter like you. https://t.co/cXblh8BZ4d", "time": "2022-03-03 17:02:54+00:00"}, "1499418925808898061": {"text": "Today, I voted to pass the Honoring Our PACT Act &amp; improve care for millions of veterans who were harmed by burn pits &amp; other toxic substances during their service.\n \nAmerican veterans fought valiantly for our country. They deserve a Congress that fights for them just as boldly. https://t.co/CwV2JgS7jM", "time": "2022-03-03 16:18:24+00:00"}, "1499395646402428936": {"text": "House Republicans took to the floor to complain about the cost of the Honoring Our PACT Act.\n\nThey should just be honest: They think it's too goddamn expensive to save the lives of our veterans.\n\nOur veterans are worth every penny we spend. I'm voting yes. https://t.co/Kq4OmyZqw7", "time": "2022-03-03 14:45:54+00:00"}, "1499188485957296128": {"text": "Vladimir Putin is on a disastrous quest to rebuild the Russian empire at the expense of Ukrainian sovereignty.\n \nToday, I voted to #StandWithUkraine and call on Russia to immediately end their unprovoked war. https://t.co/AyyPy4ezdI", "time": "2022-03-03 01:02:43+00:00"}, "1499157257866649602": {"text": "141 nations voted to stand with Ukrainians. Only 4 countries — out of 193 — stood by Russia.\n\nI commend @USAmbUN's leadership in rallying the world at the @UN. My @HouseForeign colleagues and I made numerous calls to foreign govs urging them to #StandwithUkraine and vote yes. https://t.co/6sfP6um30I", "time": "2022-03-02 22:58:37+00:00"}, "1498870884123267078": {"text": ".@POTUS is correct, we need comprehensive immigration reform.\n\nWe must create a pathway to citizenship for the millions of undocumented workers, dreamers &amp; TPS holders who help power our nation’s economy.\n\nLet’s deliver for them as they have delivered for us. #SOTU https://t.co/W3FDj9CrBM", "time": "2022-03-02 04:00:41+00:00"}, "1498859225103179777": {"text": "I’ll always stand by veterans like my #SOTU guest, @trooper1999.\n\nIn 2007, Cpt. Le Roy Torres was exposed to toxic burn pits in Iraq, leading to lung disease.\n\nThis week, @HouseDemocrats will make good on our promise &amp; expand access to care for burn pit survivors.", "time": "2022-03-02 03:14:21+00:00"}, "1498855449449357312": {"text": "America’s judges should look like the American people.\n\nPresident Biden’s SCOTUS nomination of Ketanji Brown Jackson gives Republicans an opportunity to stand on the right side of history. They should take it. #SOTU", "time": "2022-03-02 02:59:21+00:00"}, "1498854228982435843": {"text": "As we rebuild from #COVID19, Texas scientists are healing the world.\n\nWith the CORBEVAX vaccine, @TexasChildrens &amp; @bcmhouston have produced a low-cost COVID vaccine. Last month, Rep. McCaul and I urged @POTUS to partner w/our hospitals to distribute CORBEVAX across the world.", "time": "2022-03-02 02:54:30+00:00"}, "1498851874199506947": {"text": "Climate change is one of the biggest threats we face, and it's accelerating at dangerous speed.\u2028\nFrom Winter Storm Uri to Hurricane Harvey, Texans known the devastating impacts of climate change firsthand.\u2028\nGlad to see @POTUS’s commitment to this. #SOTU\n\nhttps://t.co/YNYZE0xx4D", "time": "2022-03-02 02:45:08+00:00"}, "1498850830388236292": {"text": "Child care workers deserve a living wage. \n \nTexas families deserve affordable child care. \n \nLuckily, under Democrats’ economic agenda, we can have both.\n\n#SOTU", "time": "2022-03-02 02:40:59+00:00"}, "1498850313469673473": {"text": "I’m in. https://t.co/6UNtmLXHpT", "time": "2022-03-02 02:38:56+00:00"}, "1498848845911969793": {"text": "America is at our best when we strengthen the Infrastructure of Opportunity at home &amp; lead around the world.\n \nLast month, the House passed the COMPETES Act w/my legislation to expand apprenticeships &amp; put more Texans on the path to good jobs. Time for the Senate to follow suit.", "time": "2022-03-02 02:33:06+00:00"}, "1498846871896342538": {"text": ".@POTUS has led our nation to the strongest year of job creation in American history.\n\nIn 2021 alone, Texas added 37,600 manufacturing jobs.\n\nThere’s still work to do, but Democratic policies are creating higher wages, better benefits, and strengthening Texas’ economy. #SOTU", "time": "2022-03-02 02:25:16+00:00"}, "1498845136498868225": {"text": "As Putin condemns his country to international isolation, the United States has shown our renewed power to unite the world around a just cause.\n\nWith this president, the U.S. is proud to #StandwithUkraine. \n\n#SOTU", "time": "2022-03-02 02:18:22+00:00"}, "1498780153924751364": {"text": "Greg Abbott is abusing his power to attack trans kids and their families.\n\nHis despicable actions terrify vulnerable families &amp; encourage anti-LGBT hate &amp; violence.\n\nThis is infuriating &amp; makes one thing clear: Abbott will stop at nothing to appeal to the worst in his party. https://t.co/mjJWe9ygBC", "time": "2022-03-01 22:00:09+00:00"}, "1498744531466035203": {"text": "The pandemic has taken a massive toll on Africa, pushing nearly 40 million people into extreme poverty.\n \nToday, I had the pleasure of meeting w/ @TravisLAdkins to discuss @USADF’s critical role in working w/locally-led organizations to support these communities. https://t.co/17TWKCr8z7", "time": "2022-03-01 19:38:36+00:00"}, "1498661603117522947": {"text": "It’s Primary Election Day in Texas! Please vote and let family and friends know that today is Election Day.", "time": "2022-03-01 14:09:04+00:00"}, "1498490704225517570": {"text": "As we close out #BlackHistoryMonth, I was proud to join the @HispanicCaucus to celebrate the Afro-Latino experience in the United States and recognize rich contributions of Afro-Latinos to Texas and our country. https://t.co/kub6G3LkBt", "time": "2022-03-01 02:49:59+00:00"}, "1498385541913616389": {"text": "I’m hosting a conversation with Le Roy Torres of @Burnpit360 &amp; Major General Jeffrey Phillips of @ReserveOrg to call for federal action to improve support for veterans exposed to toxic burn pits. Tune in at 2pmCT. \n\nWatch here: https://t.co/GlZwfhan5s https://t.co/WSruxEInNE", "time": "2022-02-28 19:52:06+00:00"}, "1498374242437586947": {"text": "Historically, 99% of lynching perpetrators have escaped punishment.\n \nI'm voting for the Emmett Till #AntilynchingAct to hold perpetrators accountable and finally close this dark, painful chapter in our nation's history. https://t.co/2JkP5cqjbs", "time": "2022-02-28 19:07:12+00:00"}, "1498299232012447749": {"text": "Rep. Joaquin Castro on the power of social, cultural sanctions against Russia - MSNBC https://t.co/HyK7xvsnEl", "time": "2022-02-28 14:09:08+00:00"}, "1498111187967434753": {"text": "I’ll be joining @AymanM soon to discuss the latest on the Russian invasion of Ukraine and President Biden’s upcoming State of the Union.\n\nTune in. https://t.co/UWlU9U1Bas", "time": "2022-02-28 01:41:55+00:00"}, "1498083967907647491": {"text": "🚨TOMORROW at 2pm CT, I’ll join Cpt. Le Roy Torres of @Burnpit360 &amp; Major General Jeffrey Phillips of @ReserveOrg for a Facebook live conversation to call for federal action to support veterans exposed to burn pits.\n \nTune in: https://t.co/dYOQMEhIho https://t.co/AhtuCQgDHG", "time": "2022-02-27 23:53:45+00:00"}, "1498059207895097344": {"text": "There are many reports that black Africans fleeing Ukraine are being refused entry into Poland while White Europeans are allowed to enter.\n\n@PolishEmbassyUS Poland must cease this discriminatory policy immediately and allow Africans safe harbor. Ukraine must also cooperate. https://t.co/JMcS2oa6Xz", "time": "2022-02-27 22:15:22+00:00"}, "1498035421229502473": {"text": "Earlier today, my office attended the Ukrainian Society of San Antonio’s rally to condemn Russia’s unprovoked invasion and express solidarity for the Ukrainian people abroad &amp; in our community.\n\nWe #StandWithUkraine. https://t.co/JxX92GxTPD", "time": "2022-02-27 20:40:51+00:00"}, "1497613102493413382": {"text": "🚨Tune in on Monday, Feb. 28th at 2pm CT.\n \nJoin me, Cpt. Le Roy Torres of @Burnpit360 &amp; Major General Jeffrey Phillips of @ReserveOrg for a live conversation to discuss the effects of toxic burn pits &amp; the need for federal action to help our veterans. \nhttps://t.co/dYOQMEhIho https://t.co/XJys7EBge3", "time": "2022-02-26 16:42:42+00:00"}, "1497302230273126401": {"text": "Former Texas Congressman’s mail ballot rejected. Republican voter suppression is a threat to democracy. https://t.co/hyRVb7OfSo", "time": "2022-02-25 20:07:24+00:00"}, "1497249853335691265": {"text": "Congratulations to Ketanji Brown Jackson on her historic nomination to the Supreme Court. \n\nHer credentials and experience as a public defender will make her an exceptional champion for justice and the rule of law.\n\nI look forward to the Senate’s swift confirmation. https://t.co/9WHsuDCF8a", "time": "2022-02-25 16:39:17+00:00"}, "1497242757722783745": {"text": "On Monday, Feb. 28, I’ll join Le Roy Torres of @Burnpit360 &amp; Major General Jeffrey Phillips of the Reserve Organization of America for a Facebook Live conversation to call for federal action to protect veterans exposed to burn pits.\n\nJoin us here: https://t.co/dYOQMEhIho", "time": "2022-02-25 16:11:05+00:00"}, "1497242756045058055": {"text": "Cpt. Le Roy Torres was exposed to toxic burn pits while serving in Iraq, leading to lung disease.\n\n@TxDPS refused to accommodate his disability, forcing him to resign.\n\nI supported his case to SCOTUS &amp; now I’m honored to host @trooper1999 as my guest for the State of the Union. https://t.co/sGjzixzTip", "time": "2022-02-25 16:11:05+00:00"}, "1496986351744520196": {"text": "Shameful of Pakistan’s Prime Minister Imran Khan to help validate—by his words and visit—Putin’s invasion of another sovereign nation. https://t.co/nycMaCXnBi", "time": "2022-02-24 23:12:13+00:00"}, "1496911009302331395": {"text": "The U.S. and our allies made clear to Putin that the consequences of invading Ukraine would decimate his economy &amp; incite an unprecedented backlash.\n\nBefore the invasion, I spoke w/@jdbalart about the fallout Russia would face.\n\nPutin was warned — and he will be held accountable. https://t.co/XEvBgbtncU", "time": "2022-02-24 18:12:50+00:00"}, "1496670379171094530": {"text": "Americans know that the world is safer, stronger, and more prosperous when free people are allowed to choose their own associations and their own destinies. We #StandWithUkraine (4/4)", "time": "2022-02-24 02:16:39+00:00"}, "1496670378432868352": {"text": "Putin’s actions in Ukraine have already caused a global rise in energy prices and exacerbated inflation. Continued Russian aggression could raise the prices we pay for everything from cars to food to heating oil. (3/4)", "time": "2022-02-24 02:16:39+00:00"}, "1496670377493340164": {"text": "Russia’s invasion of Ukraine is a threat to democracies around the world. If Russia is allowed to invade Ukraine without consequence, we will return to a world where the strong prey on the weak and sovereignty is conditioned on military might. (2/4)", "time": "2022-02-24 02:16:39+00:00"}, "1496670376096673794": {"text": "As the U.S. rebounds from the pandemic and confronts challenges to our own democracy, some have called on us to turn our backs on Ukraine or even – alarmingly – side with Russia.\n \nHere’s why the conflict in Ukraine matters for Americans (THREAD): (1/4)", "time": "2022-02-24 02:16:39+00:00"}, "1496620584133971968": {"text": "Instead of fixing the power grid &amp; helping Texans recover from the pandemic, @GovAbbott would rather attack children &amp; their families.\n\nHis actions place a direct target on trans youth &amp; endanger the entire LGBTQ+ community.\n\nAnd for what, political gain? It’s beyond despicable. https://t.co/GDIDWebiy4", "time": "2022-02-23 22:58:47+00:00"}, "1496605534891433987": {"text": "I strongly agree with @POTUS’s decision to levy severe sanctions against Russia.\n \nThese sanctions will target Russia’s financial institutions and oligarchs and show Putin the severe consequences of invading a sovereign nation. \n \nMake no mistake: Americans #StandwithUkraine.", "time": "2022-02-23 21:58:59+00:00"}, "1496569385061916674": {"text": "I’m glad to see @FLOTUS in San Antonio speaking w/residents &amp; military families about the challenges our Latino community faces when it comes to cancer.\u2028\u2028I look forward to working w/the Biden admin to invest in research that improves Texans' lives &amp; ends cancer as we know it. https://t.co/FaA5T2FSie", "time": "2022-02-23 19:35:20+00:00"}, "1496260633498640386": {"text": "San Antonio students, borrowers, and college counselors/mentors:\n\n@FAFSA is hosting an important webinar TOMORROW at 1 PM CT to help you determine eligibility for Public Service Loan Forgiveness &amp; begin the process for consideration.\n\nRegister below👇👇👇 https://t.co/rIgAJ9K21z", "time": "2022-02-22 23:08:28+00:00"}, "1496150893812760582": {"text": "My top priority is making sure San Antonians are up to date on the services my office offers, federal resources available, and the latest news affecting our district.\n\nSign up for my newsletter👇\nhttps://t.co/UHNRwiEUa9", "time": "2022-02-22 15:52:24+00:00"}, "1495785027589844996": {"text": "Texas has one of the highest pandemic death tolls in the nation. If your family is struggling w/ funeral costs after losing a loved one to #COVID19, help is within reach. To date, Texans have received over $176M in @FEMA funeral aid. Learn about applying: https://t.co/T4RkigLGpn", "time": "2022-02-21 15:38:35+00:00"}, "1495431353986342914": {"text": "For-profit colleges that lie &amp; misrepresent graduates’ job placement rates must be held accountable. \n\nSan Antonians who attended DeVry University may be eligible to receive a 100% loan repayment by submitting a borrower defense claim.\n\nApply here: https://t.co/3hdxIHFCtj", "time": "2022-02-20 16:13:13+00:00"}, "1495431352447127556": {"text": "Important news for student loan borrowers: The Biden admin. is erasing $31M in student debt for Texans who were victimized by for-profit colleges, including DeVry.\n\nThese schools scammed students who were trying to build a better life. Glad to see justice, finally. (1/2) https://t.co/1dCPgcS6DH", "time": "2022-02-20 16:13:12+00:00"}, "1495149143546900485": {"text": "Let's be clear on what happened here:\n\nFirst, @DanPatrick knowingly told voters the wrong address to apply for mail-in ballots.\n\nThen, TX's SoS broke their own policy to accommodate him.\n\nNow, more Texans will be unable to vote by mail because TX GOP leaders failed them again. https://t.co/VBh9u3eOfa", "time": "2022-02-19 21:31:49+00:00"}, "1495063860822396931": {"text": "The WWII internment of Japanese, Italian &amp; German Americans marked a dark chapter in our history.\n \nOn National Day of Remembrance, we honor and recognize those who suffered and continue working toward a just future where all people are treated with the respect they deserve.", "time": "2022-02-19 15:52:56+00:00"}, "1494815764116914182": {"text": "After saving 1200+ lives during the Rwandan genocide, Paul Rusesabagina moved to San Antonio and held Rwanda's government accountable for despotism.\n\nNow, he's a political prisoner.\n\nIn today's @ExpressNews, I urge Rwanda to #FreeRusesabagina. \n\nREAD 👇\nhttps://t.co/eBwHrPJqCX", "time": "2022-02-18 23:27:05+00:00"}, "1494732978831904775": {"text": "In 2021 alone, Democratic economic policies created 37,600 manufacturing jobs in Texas.\n \n(That’s nearly 3X the jobs created in 2019 under Trump)\n \nFolks, the #AmericanRescuePlan is working &amp; we are building off that momentum to create good jobs &amp; a strong economy for TX workers. https://t.co/jYf0KQ1Ygl", "time": "2022-02-18 17:58:07+00:00"}, "1494399041333047301": {"text": "Asylum is a human right.\n\nUnder Title 42, the U.S. is expelling thousands of asylum seekers fleeing war, violence &amp; climate catastrophe in their home countries.\n\nI joined over 100 of my colleagues to urge the Biden Admin to end Title 42 and protect migrants. https://t.co/cJqIKIv4P5", "time": "2022-02-17 19:51:10+00:00"}, "1494091068383580160": {"text": "I’m pleased to see the DeLorean Motor Company establishing its headquarters at @PortSanAntonio. \n\nThis is a major win that will strengthen the economy, create 450 jobs, and reaffirm San Antonio’s status as an advantageous region for vehicle manufacturing. https://t.co/gx2n7KY8z6", "time": "2022-02-16 23:27:24+00:00"}, "1494060684245671940": {"text": "Replacement theory, invasion rhetoric has gotten people killed. That’s what happened in El Paso in 2019. Yet Texas Republicans are shamelessly scapegoating immigrants. It makes American society more dangerous for historically-targeted groups — Latinos, blacks, Jews, Muslims. https://t.co/td9nnuIQ4m", "time": "2022-02-16 21:26:40+00:00"}, "1494039003225600000": {"text": "The UN and our own former @StateDept advisors agree that our continued use of Title 42 is wrong. \n\nDuring this week's @HouseForeign hearing, I pressed @State_IO on our responsibility to make sure migrants &amp; asylum-seekers are treated fairly under international law. https://t.co/1JIVHQcUeP", "time": "2022-02-16 20:00:30+00:00"}, "1493978012043431944": {"text": "Thanks to the Bipartisan Infrastructure Law I voted to pass, Texas communities will receive more than $60 million this year to build convenient, reliable, and affordable electric vehicle charging infrastructure and create good-paying jobs. #ElectrifyingAmerica https://t.co/08hspdJ6tk", "time": "2022-02-16 15:58:09+00:00"}, "1493808373724327938": {"text": "This truly represents a breakdown in the American public education system (at least in one state). https://t.co/ieYCZkrrhl", "time": "2022-02-16 04:44:04+00:00"}, "1493664151826321427": {"text": "This hearing will examine what changes need to be made to keep international orgs relevant &amp; effective. I congratulate our witness, @State_IO on her confirmation and look forward to our continued work with her bureau to address policy and management challenges. (6/6)", "time": "2022-02-15 19:10:59+00:00"}, "1493664150907723781": {"text": "Recently, Congress has made significant progress to strengthen our global leadership – and I am grateful to the State Department Bureau of International Organization Affairs for the assistance they provided with the COMPETES Act to support US participation w/the @UN. (5/6)", "time": "2022-02-15 19:10:59+00:00"}, "1493664150094024711": {"text": "Whether it’s a worldwide pandemic, or armies massing on international borders with threats of invasion, we are facing old challenges in a new guise. \n \nRight now, Russia’s military buildup and potential invasion of Ukraine is a pressing challenge to our postwar order. (4/6)", "time": "2022-02-15 19:10:58+00:00"}, "1493664149171232777": {"text": "More than 75 years after the signing of the @UN Charter, we see signs of a need to strengthen international organizations to respond to new threats. \n\nChallenges like climate change &amp; climate-driven migration have major impacts on geopolitics &amp; how we live our lives. (3/6)", "time": "2022-02-15 19:10:58+00:00"}, "1493664148345044999": {"text": "The United Nations has kept the peace between major powers for decades and plays a critical role in peacekeeping around the world. The established system of international organizations, including the @UN, has advanced our technical &amp; humanitarian cooperation in many areas. (2/6)", "time": "2022-02-15 19:10:58+00:00"}, "1493664146600177671": {"text": "Tune in: I’m convening a @HouseForeign subcommittee hearing to mark America’s renewed engagement with international organizations and signal renewed cooperation between the @StateDept and Congress on this issue.\n \nWATCH: https://t.co/GptAugSXCw (1/6)", "time": "2022-02-15 19:10:58+00:00"}, "1493645570677907463": {"text": "Today, I’m leading a @HouseForeign subcommittee hearing on the State Department’s approach to reestablish key relationships with international organizations.\n\nWe’ll hear from Assistant Secretary Michele Sison.\n\nTune in at 2pm ET: https://t.co/TIKWf3jFtf https://t.co/zDeG86NiBg", "time": "2022-02-15 17:57:09+00:00"}, "1493369483154628610": {"text": "Even as Russia appears on the brink of invading Ukraine, President Bolsonaro is visiting to deepen Brazil’s ties and become closer with Putin.\n\nThe Trump admin designated Brazil a “major non-NATO ally,” but they’re hardly acting like one. https://t.co/YuqmCm2wQU", "time": "2022-02-14 23:40:04+00:00"}, "1493323168248967171": {"text": "Early voting for the Texas primary election started today &amp; runs until February 25th — except for Presidents’ Day (2/21). \n\nBexar County voters can cast a ballot at any polling place within the county. \n\nFor hours, locations, what to bring &amp; eligibility👇\nhttps://t.co/gdRhRgFeOW", "time": "2022-02-14 20:36:02+00:00"}, "1493273844798398471": {"text": "Domestic violence is not acceptable in San Antonio or any community. \n\nI joined the @DV_Commission to provide an update on efforts I’ve taken in Congress to connect our city with federal resources to support survivors &amp; hold abusers accountable. https://t.co/AzyMLMzGuJ", "time": "2022-02-14 17:20:02+00:00"}, "1492254076008116232": {"text": "As the situation in Ukraine develops, my priority is the safety of Americans on the ground.\n\nThe State Department urges all Americans in Ukraine to leave the country immediately. For more information and to register for @StateDept alerts, click here: https://t.co/8OOJc2QL2F https://t.co/sVeXuqRYM1", "time": "2022-02-11 21:47:51+00:00"}, "1492233926173147147": {"text": "Thousands of immigrant children &amp; families were cruelly separated under Trump’s zero-tolerance policy, causing immense pain and trauma.\n\nMy bill with @SenBlumenthal will help these families safely reunite in the U.S. and provide a pathway to citizenship. \nhttps://t.co/oWe4Yjp104", "time": "2022-02-11 20:27:47+00:00"}, "1492181181772845057": {"text": "The internet is vital for work, school, healthcare &amp; more. \u2028\u2028Yet nearly 20% of Bexar County households are without it. \u2028\u2028Through the Infrastructure Law, I voted to secure $14.2B to lower the cost of internet service. Learn how this can help you: https://t.co/IntRtAvE9N", "time": "2022-02-11 16:58:11+00:00"}, "1491869129095233536": {"text": "As San Antonio grows, we need to expand public transit to relieve congestion &amp; help our city grow.\n \n@USDOT announced that San Antonio will receive $12.7 million in VIA funding that I voted for – with more on the way to create good jobs and expand opportunity for all.", "time": "2022-02-10 20:18:12+00:00"}, "1491594182699491333": {"text": "Adding to a string of excellent foreign affairs confirmations — congratulations to @sashanbaker! Sasha is one of our nation’s finest foreign policy thinkers and her continued service at the Pentagon will help us lead with compassion and strength on the world stage. https://t.co/P8TwABjYmQ", "time": "2022-02-10 02:05:40+00:00"}, "1491497382944690187": {"text": "The fight for equality can't stop at our nation’s borders. \n\nI voted for and the House passed the #GlobalRespectAct to deny visas to those who commit human rights abuses against the LGBTQ+ community.\n\nActs of violence will not be tolerated at home or abroad. https://t.co/UhcIz0FGxB", "time": "2022-02-09 19:41:01+00:00"}, "1491477110053130241": {"text": "Congratulations to Scott Nathan on his successful confirmation as CEO of @DFCgov! His deep experience in strategic investment and global affairs will be a tremendous asset as DFC works to strengthen U.S. leadership and support development in places with the greatest need. https://t.co/JSV7gKFjqd", "time": "2022-02-09 18:20:27+00:00"}, "1491434192722599936": {"text": "Abandoning our veterans is unconscionable.\n \nI’m leading an amicus brief to SCOTUS to support @trooper1999’s lawsuit &amp; defend veterans' rights to return to their civilian jobs.\n \nTX veterans fought for us &amp; it’s an honor to fight for them. (3/3)\nhttps://t.co/hMe3JFeY8j", "time": "2022-02-09 15:29:55+00:00"}, "1491434191397208066": {"text": "Captain Torres's exposure to toxic burn pits gave him a devastating lung disease that makes it hard to breathe.\n \nHe asked @TxDPS to reassign him to a desk job. Instead, they forced him to resign — and then the state rejected his disability claim. (2/3)\nhttps://t.co/gxXCIAsPrX", "time": "2022-02-09 15:29:55+00:00"}, "1491434189459456002": {"text": "Captain Le Roy Torres had been a member of the U.S. Army Reserves for 18 years when he was deployed to Iraq in 2007 to serve our nation.\n \nAfter serving bravely, he was honorably discharged and tried to return to work as a Texas state trooper. (1/3)", "time": "2022-02-09 15:29:54+00:00"}, "1491231131588444162": {"text": "The @USPS delivers life-saving medications, urgent packages &amp; more to Texas and across the country. Yet its financial condition has deteriorated over the past decade. \n\nI voted to pass the #PostalServiceReformAct, ensuring the Postal Service continues its work for years to come. https://t.co/XJcxLHKYDp", "time": "2022-02-09 02:03:02+00:00"}, "1491213430568546304": {"text": "Congratulations to Chantale Yokmin Wong on her history-making confirmation!\n \nAmbassador Wong is an exceptional leader &amp; her prior experience with ADB will help her hit the ground running in her new role. I look forward to working with her to advance our global development goals. https://t.co/opD1jeN3a3", "time": "2022-02-09 00:52:41+00:00"}, "1491172294982795264": {"text": "This is what a hero looks like.\n \n28 years ago, Paul Rusesabagina saved 1200+ lives during the Rwandan genocide.\n \nIn 2020, Rwanda imprisoned him on politically motivated charges. Today, @HouseForeign passed my resolution w/@RepYoungKim demanding that Rwanda #FreeRusesabagina. https://t.co/xqN9ylTxrT", "time": "2022-02-08 22:09:14+00:00"}, "1491118347274317824": {"text": "San Antonio is home to many Cameroonian-Americans. Today, @HouseForeign will mark up a resolution I cosponsored to condemn the Cameroonian government for abuses committed in the Anglophone region and urge them to work with local leaders to address grievances and end violence. 2/2", "time": "2022-02-08 18:34:52+00:00"}, "1491118346259267584": {"text": "Today, @HouseForeign will debate my resolution w @RepYoungKim calling on Rwanda to #FreeRusesabagina — a US resident &amp; hero who saved countless lives during the Rwandan genocide. We will not stop pressing this issue until Paul Rusesabagina returns to his family in San Antonio. 1/", "time": "2022-02-08 18:34:52+00:00"}, "1491096025465241600": {"text": "🚨 SAN ANTONIO 🚨\u2028\u2028My San Antonio office is currently unable to answer phone calls due to a building-wide outage. While we quickly work to resolve the issue, I urge any district residents in need of assistance to contact my DC office at (202) 225-3236.", "time": "2022-02-08 17:06:10+00:00"}, "1491065786781384705": {"text": "I’ll be joining @JDBalartMSNBC soon to discuss the Remain in Mexico program and the Russia-Ukraine conflict. \n\nTune in at 10:45 am ET / 9:45 am CT. https://t.co/XNQRkM6YC8", "time": "2022-02-08 15:06:00+00:00"}, "1490832364003495936": {"text": "This is a terrible decision and further undermines the Voting Rights Act.\n\nThis will only embolden Republican-led state legislatures who are vying to silence minority communities — particularly in Texas where maps have been racially gerrymandered for years. https://t.co/kO9PH6N4R2", "time": "2022-02-07 23:38:28+00:00"}, "1489994666485374977": {"text": "The 2022 tax season is here and runs until April 18!\n\nWant to speed up the process? File electronically as early as possible &amp; opt for direct deposit.\n\nNeed help filing? Use the free IRS Volunteer Income Tax Assistance tool. \n\nMore info on how to file ⤵️\nhttps://t.co/aD2SaN4P7T", "time": "2022-02-05 16:09:45+00:00"}, "1489761188317704197": {"text": "Over the past two years alone, Congressional staff have kept our government running through an insurrection and a global pandemic. If our hard-working staff choose to unionize, they have my full support. #UnionStrong", "time": "2022-02-05 00:42:00+00:00"}, "1489721620142907394": {"text": "I hope you’re right but I think it’s too little, too late to save the GOP. https://t.co/m2xUH6TCTm", "time": "2022-02-04 22:04:46+00:00"}, "1489685580959166468": {"text": "The Latino story is an American story and a central thread in our nation’s history.\n\nIn 2020, Congress established the new Smithsonian’s National Museum of the American Latino.\n\nCongratulations to @Jorge_Zamanillo on being named its first director! https://t.co/fzcXO1VYr8", "time": "2022-02-04 19:41:34+00:00"}, "1489639937938972674": {"text": "I voted for and the House passed the American COMPETES Act.\n\nI’m proud to have authored provisions of this bill that will protect our national security, reignite our alliances, and create the workforce development opportunities Americans deserve.\nhttps://t.co/D2TrILzrlR", "time": "2022-02-04 16:40:12+00:00"}, "1489624966421172229": {"text": "Omicron has been especially scary for parents w/kids too young to be vaccinated. @POTUS is working to increase #COVID19 support for schools, but we can't leave child care behind.\n\nToday, I called on the admin. to expand testing &amp; PPE for child care providers. Read my letter 👇 https://t.co/9DpixWsT6h", "time": "2022-02-04 15:40:42+00:00"}, "1489445635191365633": {"text": "So you don’t think you should have the right to vote? https://t.co/plwBJ8hUZh", "time": "2022-02-04 03:48:06+00:00"}}