{"ids": [1500480420747661317, 1499793174491025412, 1499780436880470017, 1499519450529337348, 1499455950981406720, 1499444713090437124, 1499081537677144069, 1498851029869281284, 1498844851458162689, 1498796765683847168, 1498745105506836486, 1498744502961557505, 1498424836154134531, 1498306403173376003, 1498041734567120896, 1498027496788434944, 1497736567993114626, 1497305687831023617, 1497303757133996034, 1497286525750550533, 1496893218734350338, 1496700996847816713, 1496603922345119754, 1496561475695091715, 1496285930981924867, 1496271994135928837, 1496254304000299014, 1495055070504828936, 1495039215943372803, 1494719107161366529, 1494442964734590982, 1494424599613915136, 1494391222512848896, 1494320324103401477, 1494012176604045320, 1493984384449486848, 1493944353512960016, 1493758039928754177, 1493732740252016640, 1493351595806887936, 1493336244612390912, 1493316958598664195, 1493301705349517312, 1493292132723052548, 1492488408035381257], "1500480420747661317": {"text": "The @January6thCmte announced it has evidence that Donald Trump and his campaign broke multiple federal laws while trying to overturn the 2020 election. More here: https://t.co/1nIsai69UC", "time": "2022-03-06 14:36:24+00:00"}, "1499793174491025412": {"text": "Thread on record-breaking economic growth under @POTUS 🧵 https://t.co/cZSXk5gmqu", "time": "2022-03-04 17:05:32+00:00"}, "1499780436880470017": {"text": "An incredible February jobs report smashes expectations.\n\n7.4 million jobs created under @POTUS, the fastest economic growth in nearly 40 years, and the sharpest drop in the unemployment rate ever.\n\nThat's how you build a better America! https://t.co/yygm0RhugH", "time": "2022-03-04 16:14:55+00:00"}, "1499519450529337348": {"text": "Excellent news: @SecMayorkas just announced that Ukraine has been designated for Temporary Protected Status (TPS). Update here: https://t.co/K8ZUS1BgRC https://t.co/j0PhTUzIi1", "time": "2022-03-03 22:57:51+00:00"}, "1499455950981406720": {"text": "The Commonwealth of Regular Virginia https://t.co/YML9EElZcn", "time": "2022-03-03 18:45:31+00:00"}, "1499444713090437124": {"text": "Lavrov-eque lies. Literally none of this is true. https://t.co/Y9V58Zfp2f", "time": "2022-03-03 18:00:52+00:00"}, "1499081537677144069": {"text": "Today in our @WaysMeansCmte hearing \"Substance Use, Suicide Risk, and the American Health System\" I'm discussing our work on bipartisan Suicide Prevention Task Force, including supporting the upcoming launch of the new number - 988 - for the National Suicide Prevention Lifeline. https://t.co/ViFhsHt3Hl", "time": "2022-03-02 17:57:44+00:00"}, "1498851029869281284": {"text": "It's true. The most jobs created in one year ever. https://t.co/uUrse6sKKb", "time": "2022-03-02 02:41:47+00:00"}, "1498844851458162689": {"text": "A powerful, bipartisan moment at the beginning of @POTUS' State of the Union address. America stands with Ukraine. https://t.co/FQcyylpoDI", "time": "2022-03-02 02:17:14+00:00"}, "1498796765683847168": {"text": "I've signed onto multiple efforts – led by @RepMikeQuigley @RepJimmyGomez @RepEspaillat – to get Temporary Protected Status (TPS) for Ukrainians in the United States. Designating Ukraine for TPS is the right thing to do, and it needs to happen swiftly.", "time": "2022-03-01 23:06:09+00:00"}, "1498745105506836486": {"text": "And not just symbolically -- we are working together and with the Administration to provide American support, including funding defensive aid and humanitarian assistance as well as ratcheting up economic pressure on Russia. Congress and the American people stand with Ukraine.", "time": "2022-03-01 19:40:53+00:00"}, "1498744502961557505": {"text": "The U.S. House of Representatives stands with Ukraine! https://t.co/C9EiYtiSqC", "time": "2022-03-01 19:38:29+00:00"}, "1498424836154134531": {"text": "The latest UN report on the climate crisis says the threat posed by climate change is so great that we may be unable to adapt. Urgent action required ASAP. Many of us are working on this, but certain people are standing in the way and we don't have time. https://t.co/4CoRAfLFSA", "time": "2022-02-28 22:28:14+00:00"}, "1498306403173376003": {"text": "As I noted yesterday, the Russian elite have major ties to Switzerland, and big investments there. Many of their children attend Swiss schools. Need to see the details of these sanctions but this is a major development and an important move by historically neutral Switzerland. https://t.co/NvcylVS4qC", "time": "2022-02-28 14:37:38+00:00"}, "1498041734567120896": {"text": "The Blame America First party is sowing division at home and undermining our President on the world stage as he works with our allies to push back against Putin’s aggression.\n\nHow does this help Ukraine? It doesn’t. https://t.co/oCnB00GUAP", "time": "2022-02-27 21:05:56+00:00"}, "1498027496788434944": {"text": "Good to see Switzerland step up. I was U.S. Ambassador there for four  years under President Obama — the Russian elite have widespread investments and other ties to Switzerland. This would hurt. https://t.co/QEZD0HxuJA", "time": "2022-02-27 20:09:21+00:00"}, "1497736567993114626": {"text": "Back here on Earth 1, we remember that Donald Trump illegally withheld defensive military aid to Ukraine to blackmail President Zelensky for political favors.\n\nHe sided with Putin against American intelligence. He praised Russia, estranged our friends, and weakened our alliances. https://t.co/renoEuRE6p", "time": "2022-02-27 00:53:19+00:00"}, "1497305687831023617": {"text": "President Biden's nomination of Judge Ketanji Brown Jackson to serve as Associate Justice on the United States Supreme Court is an important moment in American history. Her inspirational remarks today are worth watching in full: https://t.co/KQMcENNd5k", "time": "2022-02-25 20:21:09+00:00"}, "1497303757133996034": {"text": "@JayCShambaugh @WhiteHouse Congratulations, this is great!", "time": "2022-02-25 20:13:28+00:00"}, "1497286525750550533": {"text": "If you think Russia's invasion of their neighbor Ukraine raised security concerns across the region, wait until you see the effects of Putin directly threatening other free nations with \"military repercussions.\" You don't need diplomatic experience to see how this will backfire. https://t.co/TudpRy8VvT", "time": "2022-02-25 19:05:00+00:00"}, "1496893218734350338": {"text": "It's this simple: either you're on the side of freedom, democracy, and peace, or you're on the side of aggression, autocracy, and war.\n\nThis moment requires a choice, and the people attacking our President while backing Putin's non-secret admirer right now have made theirs. https://t.co/wTQ9Zj3VTy", "time": "2022-02-24 17:02:08+00:00"}, "1496700996847816713": {"text": "Praying for the Ukrainian people tonight. America stands with Ukraine. 🇺🇸🇺🇦", "time": "2022-02-24 04:18:19+00:00"}, "1496603922345119754": {"text": "Terribly sorry to hear of this loss. Dr. Paul Farmer was a hero and an inspiration, someone who threw himself into making people's lives better around the world. My condolences to his family. https://t.co/z3Acl5gwxy", "time": "2022-02-23 21:52:35+00:00"}, "1496561475695091715": {"text": "This important report helps provide a blueprint of what we have to do to build a more inclusive economy that values and honors the work of Black Americans. Constructive info from this partnership between @JECDems and @RepBeatty @TheBlackCaucus for #BlackHistoryMonth: https://t.co/r6He6hZ7w4", "time": "2022-02-23 19:03:55+00:00"}, "1496285930981924867": {"text": "Excellent news, if long overdue. Women deserve equal pay for equal work - period! https://t.co/al4CDACZrN", "time": "2022-02-23 00:49:00+00:00"}, "1496271994135928837": {"text": "He brings our allies together to present a unified response to Putin's aggression and all these people can think to do is attack our President and show Putin the division he wants. On the same day Donald \"withhold Ukraine's defensive aid\" Trump praises Putin for invading Ukraine. https://t.co/NJBXVvX3U7", "time": "2022-02-22 23:53:37+00:00"}, "1496254304000299014": {"text": "Super-rich sports team owners like Dan Snyder don't need federal support to build their stadiums, and taxpayers shouldn't be forced to fund them. I just joined @RepSpeier @repblumenauer to introduce the No Tax Subsidies for Stadiums Act. Read about it here https://t.co/W5KYm3tcQy", "time": "2022-02-22 22:43:19+00:00"}, "1495055070504828936": {"text": "Huge news, and a big win for Sandy Hook families. Gun manufacturers get legal immunities unlike any other industry -- and Congress can end that by repealing the Protection of Lawful Commerce in Arms Act, something I've long supported. https://t.co/TOVVt6Rdts", "time": "2022-02-19 15:18:00+00:00"}, "1495039215943372803": {"text": "The climate crisis is here and now, and the longer we wait to take bold action the worse it's going to be. We need to pass the Build Back Better Act. https://t.co/iihKuSbQKQ", "time": "2022-02-19 14:15:00+00:00"}, "1494719107161366529": {"text": "Sad news -- sending my condolences to his family today. https://t.co/9PTy8pSZ5h", "time": "2022-02-18 17:03:00+00:00"}, "1494442964734590982": {"text": "As we keep saying, the enhanced Child Tax Credit was an incredibly successful provision that dramatically reduced child poverty. There is no good argument for letting the CTC expire and refusing to renew it. https://t.co/5BjOtcLvA3", "time": "2022-02-17 22:45:42+00:00"}, "1494424599613915136": {"text": "We recognize the contributions of Black Americans and work to address structural barriers throughout the year. Black History Month presents a good opportunity to shine a light on progress and to address racial disparities in our society and in our economy. With @TheBlackCaucus: https://t.co/J4vKvDYUOR", "time": "2022-02-17 21:32:44+00:00"}, "1494391222512848896": {"text": "Kevin McCarthy is lying, again. https://t.co/TvvEttRUyH https://t.co/qefzhQBzMJ", "time": "2022-02-17 19:20:06+00:00"}, "1494320324103401477": {"text": "I appreciate Ashton Heights Civic Association inviting me to speak at their monthly meeting -- we discussed the economy, rank choice voting, mitigating helicopter noise, supporting small businesses, and much more. https://t.co/xu1mZm5t3b", "time": "2022-02-17 14:38:23+00:00"}, "1494012176604045320": {"text": "I met with local Black business owners last night to hear perspectives on issues facing their businesses in the federal government contracting space. A very helpful conversation as we work to assist Northern Virginia small business owners and advocate on their behalf. https://t.co/y5mfnZXJRI", "time": "2022-02-16 18:13:54+00:00"}, "1493984384449486848": {"text": "Excellent news, and yet another sign of a surging U.S. economy. https://t.co/fTmR4tuKY9", "time": "2022-02-16 16:23:28+00:00"}, "1493944353512960016": {"text": "Ryan Zimmerman was the man for his time and place. Thanks for everything, on behalf of a grateful region. We'll miss you! https://t.co/4EAUApnMWD", "time": "2022-02-16 13:44:24+00:00"}, "1493758039928754177": {"text": "The Fed is a central player in our response to inflation, but Republicans are blocking consideration and confirmation of the President’s appointees to lead it. This does not help at all. https://t.co/OO92NmQLCz", "time": "2022-02-16 01:24:04+00:00"}, "1493732740252016640": {"text": "Thank you @ArlingtonVA County Board for a productive discussion today about national and local issues impacting our constituents. I look forward to our continued partnership! https://t.co/OGibFtFmJw", "time": "2022-02-15 23:43:32+00:00"}, "1493351595806887936": {"text": "Data from @BLS_gov shows that Virginia's unemployment rate remained below the national rate and fell steadily under @RalphNortham, dropping to 3.2% when he left office.\n\nSee job creation and unemployment statistics in your state here via @JECDems: https://t.co/qkSD7oCsxM https://t.co/inthYylqz9", "time": "2022-02-14 22:29:00+00:00"}, "1493336244612390912": {"text": "Appreciate @DanStorck inviting me to speak at his annual Mount Vernon Town Hall over the weekend, and everyone who came to listen and talk. A great gathering! https://t.co/OtPjn6FW1y", "time": "2022-02-14 21:28:00+00:00"}, "1493316958598664195": {"text": "I support legislation to ban Members of Congress and their spouses from trading individual stocks. Last month I cosponsored @RepSpanberger's TRUST in Congress Act and @CongressmanRaja' Ban Conflicted Trading Act  to make this important reform.", "time": "2022-02-14 20:11:22+00:00"}, "1493301705349517312": {"text": "Four years ago 17 people were killed and 17 more injured in a mass shooting at Marjory Stoneman Douglas High School. Parkland's tragedy still hurts, and as we remember those we lost that day, we remain focused on the need to do much more to prevent gun violence.", "time": "2022-02-14 19:10:45+00:00"}, "1493292132723052548": {"text": "Excellent news that will protect much - though not all - of America's recovering population of gray wolves. Still very important that @USFWS @Interior restore gray wolves' ESA protections. https://t.co/YVzCBn5iqg", "time": "2022-02-14 18:32:43+00:00"}, "1492488408035381257": {"text": "Beyer Votes to Improve USPS Mail Delivery | Falls Church News Press\nhttps://t.co/XvJ8BYj3Fd", "time": "2022-02-12 13:19:00+00:00"}}