{"ids": [1499772723840667653, 1499210858584494084, 1498860392302448641, 1498857857827196932, 1498855464955793410, 1498852755083079685, 1498847832303886337, 1498728672974495752, 1497230999608078339, 1496663702199803904, 1496542445827465221, 1496204446828830725, 1496204445843132418, 1496204444505100291, 1495770152679485445, 1494064444250464256, 1493341645118623758, 1491877126353702917, 1491148367497469952, 1491062713669517319, 1488917336178544643, 1488917334882492419, 1488917333783588867, 1488917332567146505, 1488917331468341253, 1488917330398781446, 1488917329274720259, 1488917328179904512, 1488917326460329986, 1488888951901462529, 1488726182061350915, 1488622709030465549, 1488231559966732289, 1486767263801819140, 1486767262539341830, 1486750042757255168, 1484896900633571330, 1483557269946183680, 1483110967676448770, 1482049483869495296, 1482049482724462596, 1480996309716946950, 1480970818226061314, 1480248573942022150, 1479483058227228673, 1479206333354323976, 1479092017267412997, 1479092015870660611, 1479092014595690503, 1479092012762767368, 1479092011349295108, 1479092009684058113, 1479092007972880388, 1479092006605533187, 1479092005292630018, 1479092003065507843, 1479092001610031112, 1479091999772917762, 1478822367610691584, 1477441612515090435, 1477313564968951809, 1476007808269271048, 1475152305297231874, 1474753286804811780, 1474463068231016452, 1474115621298360323, 1473702808746614797, 1473383672078385158, 1473376504335720452, 1473376502775529474, 1468704810631417856, 1468336149479448580, 1467136924733300748, 1465690410257457156, 1465101704295243780, 1465094597785358339, 1463902323843948556, 1463599922482225163, 1463555669311856650, 1462801337104666629, 1462801336072871940, 1462801335078817796, 1462801333552099332, 1461783851177500672, 1461710107893542912, 1461710106601701380, 1461489506230677510, 1458785848833593345, 1458536181726158853, 1456837363926282245, 1456722337395613700, 1456274416967438338], "1499772723840667653": {"text": "Excited to be back at my Alma Mater @HowardU today to speak at its 155th Charter Day Convocation.\n\nTune in LIVE at 11 to watch the ceremony at https://t.co/8vipkZlVcH https://t.co/FdRKmncz0D", "time": "2022-03-04 15:44:16+00:00"}, "1499210858584494084": {"text": "Yesterday's bombing by Russia hit Babyn Yar, the memorial site where over 33,000 Jews were executed, and tens of thousands more fell victim during German occupation. A holocaust site desecrated by an invasion offensively justified as \"de-nazifying\" Ukraine. https://t.co/NF7xdH2ZPf", "time": "2022-03-03 02:31:37+00:00"}, "1498860392302448641": {"text": "@POTUS: The State of the Union is strong because the American people are strong 💪🏾💪🏾💪🏾", "time": "2022-03-02 03:18:59+00:00"}, "1498857857827196932": {"text": "Reuniting families is not just the right thing to do but an economically smart thing to do. I stand with @POTUS in increasing the number of immigration judges so that we can hear these cases in a more efficient manner and reach a just outcome for these families #SOTU", "time": "2022-03-02 03:08:55+00:00"}, "1498855464955793410": {"text": "We have made significant strides fighting COVID under @POTUS’ leadership.\n\nWe have reached a point where it no longer control our lives and have more tools to continue to mitigate the spread. You can now order more FREE at-home tests at https://t.co/uq3Rjppazm #SOTU", "time": "2022-03-02 02:59:24+00:00"}, "1498852755083079685": {"text": "I stand with @POTUS in calling on the Senate to confirm his nominees for the @FederalReserve. His nominees will not only fight inflation, they’ll bring the Fed closer to representing the diversity of our nation.  #SOTU", "time": "2022-03-02 02:48:38+00:00"}, "1498847832303886337": {"text": "Thanks to @POTUS we’re done talking about infrastructure weeks, we’re talking about an infrastructure decade with meaningful investments in communities that need them the most. #SOTU", "time": "2022-03-02 02:29:05+00:00"}, "1498728672974495752": {"text": "Join me tonight LIVE at 5PM for a pre-discussion on the 2022 State of the Union Address at https://t.co/9Ar1qnver7 https://t.co/gfzsjPRhD2", "time": "2022-03-01 18:35:35+00:00"}, "1497230999608078339": {"text": "I applaud @POTUS’ historic nomination of Ketanji Brown Jackson to the SCOTUS as an important step towards greater inclusion. While she will inspire generations of Black women to come, she’ll also add value to the Court &amp; broaden its perspective given her strong legal background.", "time": "2022-02-25 15:24:22+00:00"}, "1496663702199803904": {"text": "Trump’s praise for Putin represents a dangerous pro-authoritarian under-toe in the American Right, and it should be universally condemned.", "time": "2022-02-24 01:50:07+00:00"}, "1496542445827465221": {"text": "While the typical Black household’s income has risen since the 1970s, Black households still earn just 62 cents for every dollar earned by white households – a difference of ~$30,000 per year.  #JECxCBC\n\nhttps://t.co/fj6PPfH0t3 https://t.co/nHvj9VV3B5", "time": "2022-02-23 17:48:18+00:00"}, "1496204446828830725": {"text": "Several other notable convictions have been reached since this push. Let today’s verdict serve as a strong pronouncement that hate has no place in our society. (3/3)", "time": "2022-02-22 19:25:12+00:00"}, "1496204445843132418": {"text": "In many ways, Democratic efforts in Congress were critical to today’s verdict including passage of @RepGraceMeng’s COVID-19 Hate Crimes Act, an already aggressive @TheJusticeDept was ordered to expedite reviews of federal hate crimes including Arbery’s case. (2/3)", "time": "2022-02-22 19:25:12+00:00"}, "1496204444505100291": {"text": "Today, a jury confirmed that the three men who murdered Ahmaud Arbery were motivated by racial hatred. Tomorrow marks the two year anniversary of Arbery’s tragic death, and unfortunately hate crimes and stories like this are ever increasing. (1/3)", "time": "2022-02-22 19:25:12+00:00"}, "1495770152679485445": {"text": "Black girls across America should be afforded the same opportunity to see themselves as protectors and perfecters of all our democratic institutions, especially the Supreme Court.\n\nhttps://t.co/IKlS668ayj", "time": "2022-02-21 14:39:29+00:00"}, "1494064444250464256": {"text": "MDIs and CDFIs are lifelines for small businesses &amp; underserved communities; that’s why I reintroduced my Ensuring Diversity in Community Banking Bill. As we look forward to its advancement, I applaud @FSCDems for being laser focused on expanding financial opportunities. https://t.co/n51rSWiMPd", "time": "2022-02-16 21:41:36+00:00"}, "1493341645118623758": {"text": "As we celebrate the chosen birthday of influential abolitionist Frederick Douglass, let us remember that \"without a struggle, there can be no progress.\" #BlackHistoryMonth", "time": "2022-02-14 21:49:27+00:00"}, "1491877126353702917": {"text": "Known for her works that address the intersectionality of Black identity, feminism, marginalization &amp; climate change, Amanda Gorman gained notoriety from her poem \"The Hill We Climb\" read at the 2021 inauguration of @POTUS. #BlackHistoryMonth https://t.co/jesQpxx6A4", "time": "2022-02-10 20:49:59+00:00"}, "1491148367497469952": {"text": "From reaching America’s unbanked to securely delivering humanitarian aid abroad, the potential digital assets present are great. Today’s @FSCDems hearing on stablecoins was critical to understanding how lawmakers can best protect the public while enabling responsible innovation. https://t.co/aj8w4CUYVD", "time": "2022-02-08 20:34:09+00:00"}, "1491062713669517319": {"text": "Thank you @POTUS for making N95 masks free and available.\n \nResidents in the district can pick up free masks at Community Healthcare Network 90-04 161st St, Jamaica while supplies last.\n \nGo to https://t.co/axnj3lV1n1 for more info", "time": "2022-02-08 14:53:48+00:00"}, "1488917336178544643": {"text": "A two state solution is the only way to assure that both peoples are provided the freedom, security and justice they deserve. I think Amnesty International report, due to its purposefully inciteful nature, doesn’t help that effort.", "time": "2022-02-02 16:48:50+00:00"}, "1488917334882492419": {"text": "As Chairman, I have traveled to Israel and the West Bank and have met with Israelis and Palestinians young and old, rich and poor. I have met Israel’s new government, as well as Palestinian Authority leadership. They both have an enormous amount of work to do.", "time": "2022-02-02 16:48:50+00:00"}, "1488917333783588867": {"text": "But, issuing such an inflammatory report - which makes no effort to explain the challenges Israel faces, or the history of the Jewish people - does not do justice in seeking real solutions to the conflict.", "time": "2022-02-02 16:48:49+00:00"}, "1488917332567146505": {"text": "The extensive #humanrights reporting about the plight of Palestinians in the West Bank and Gaza cannot be overlooked. Demolitions, settlement expansion, arbitrary detentions, harassment and other injustices can and must end.", "time": "2022-02-02 16:48:49+00:00"}, "1488917331468341253": {"text": "Amnesty International plays an important role around the world, and civil society needs to be supported and nurtured. But it is clear that even the title of the report is intended to be more inflammatory than a report from Amnesty should aspire to be.", "time": "2022-02-02 16:48:49+00:00"}, "1488917330398781446": {"text": "We should not forget, American security assistance, for items such as the Iron Dome missile defense system, protects Jewish and Muslim lives alike. And the bulk of the aid is utilized to defend against foreign attack.", "time": "2022-02-02 16:48:48+00:00"}, "1488917329274720259": {"text": "These aren’t only harmful policy recommendations, but Amnesty International appears to be going out of its way to lobby countries to end their support for Israel. I don’t support that, nor do the bulk of my constituents, nor does this Congress.", "time": "2022-02-02 16:48:48+00:00"}, "1488917328179904512": {"text": "Several of the report’s policy recommendations, which include ending all US security assistance for Israel and promoting the “right of return” for Palestinian refugees, would threaten Israel’s existence.", "time": "2022-02-02 16:48:48+00:00"}, "1488917326460329986": {"text": "The seemingly biased report issued yesterday by Amnesty International on the Israeli-Palestinian conflict only emboldens those who organize tirelessly to eliminate the Jewish State. https://t.co/YSiEclbRPt", "time": "2022-02-02 16:48:48+00:00"}, "1488888951901462529": {"text": "Wishing the NYPD Officer that was wounded a swift recovery.\n\nThe rise of gun violence and violent crimes is a public health crisis. Residents in the Rockaways and all over the city should feel safe. https://t.co/ldsk6yIlNA", "time": "2022-02-02 14:56:03+00:00"}, "1488726182061350915": {"text": "Happy Lunar New Year! As we enter this #YearoftheTiger, may you carry bravery and strength as we overcome the current pandemic. Wishing you a year of great prosperity and fortune!", "time": "2022-02-02 04:09:15+00:00"}, "1488622709030465549": {"text": "As we enter the first day of #BlackHistoryMonth, we are reminded that change is still deeply needed. The threats that my alma mater @HowardU received are unacceptable. HBCU's are a cornerstone of Black history and Black communities. They must be protected. https://t.co/PfLeNR67rd", "time": "2022-02-01 21:18:05+00:00"}, "1488231559966732289": {"text": "The @WhiteHouse released a new, comprehensive resource on @POTUS’s Bipartisan Infrastructure Law. The guidebook, available at https://t.co/I7N1KvEERN, can help NY communities navigate available funding opportunities and historic benefits.\n \nTogether, we're #BuildingABetterAmerica", "time": "2022-01-31 19:23:48+00:00"}, "1486767263801819140": {"text": "I applaud @POTUS for standing by his commitment to nominate the first ever Black woman to the Supreme Court and look forward to him fulfilling this promise. (2/2)", "time": "2022-01-27 18:25:13+00:00"}, "1486767262539341830": {"text": "Supreme Court Justice Breyer has been an exemplary judge and I thank him for his 28 years of service on the bench. I wish him a happy retirement. (1/2)", "time": "2022-01-27 18:25:12+00:00"}, "1486750042757255168": {"text": "As Holocaust Survivor Elie Wiesel once said \"The opposite of love is not hate, it's indifference.\" Today, on #HolocaustRemembranceDay, we remember the six million Jewish lives lost. #NeverAgain", "time": "2022-01-27 17:16:47+00:00"}, "1484896900633571330": {"text": "Today marks the 49th anniversary of Roe v. Wade. Reproductive rights and access are still under attack across the country disproportionately harming communities already facing systemic discrimination.\u2028\u2028The Senate must pass the Women’s Health Protection Act #WHPA", "time": "2022-01-22 14:33:03+00:00"}, "1483557269946183680": {"text": "Go to https://t.co/2LloZQWoL4 to order your FREE at-home COVID-19 rapid antigen testing kits. One order includes 4 individual tests.\n\n- Get vaccinated. \n- Get boosted. \n- Get tested. \n- Wear a mask. \n\nThe only way out of this pandemic is together!", "time": "2022-01-18 21:49:50+00:00"}, "1483110967676448770": {"text": "To truly honor #MLK, we must secure voting rights through law. \n\nLike those who fought against Dr. King’s vision of America, a minority of Senators have consistently blocked proposals protecting the core of our democracy. \n\nAs I often say, the cameras of history are rolling. https://t.co/omoj70IJYF", "time": "2022-01-17 16:16:24+00:00"}, "1482049483869495296": {"text": "The historic nominations of two Black economists to the Federal Reserve is especially pleasing at a time when our country is in dire need of an equitable recovery from a pandemic economy. \n\nThe greater need for diversity at the Federal Reserve is long overdue. (2/2)", "time": "2022-01-14 17:58:26+00:00"}, "1482049482724462596": {"text": "I commend @POTUS for nominating Sarah Bloom Raskin as Vice Chair for Supervision to the @federalreserve. If approved by the Senate, she will be the first woman to ever serve in this role and lead the most diverse Fed Board of Governors in its 108-year history. (1/2)", "time": "2022-01-14 17:58:26+00:00"}, "1480996309716946950": {"text": "Join me LIVE on Facebook tonight with:\n\n- Elmont Family Health Center \n- Jamaica Hospital\n- Joseph P. Addabbo Family Health Center\n- St. John’s Episcopal Hospital \n- NYC Health + Hospitals (Queens)\n\nWe’ll chat about COVID-19 and how it’s impacting their facilities. See you at 5! https://t.co/tirRbAWd9n", "time": "2022-01-11 20:13:30+00:00"}, "1480970818226061314": {"text": "Preserving the People’s power in representative government should override preserving procedure. \n\nThe question before the Senate on the filibuster is this: do you put perfunctory procedure over the People? \n\nHanging in the balance is our Democracy itself. #VotingRightsAct", "time": "2022-01-11 18:32:12+00:00"}, "1480248573942022150": {"text": "The right to vote is essential to the democracy of the U.S. and if we’re going to lead in Democratic circles, we should lead by example.\n\nCongress needs to pass #VotingRights reforms. The American people can’t wait any longer https://t.co/R35h98hXUd", "time": "2022-01-09 18:42:16+00:00"}, "1479483058227228673": {"text": "Sidney Poitier lived the American Dream. Of Afro-Caribbean descent, he made theatrical history in classics like “A Raisin in the Sun” and advanced Black culture on the screen. I pray his family is comforted during this time.  \n\nhttps://t.co/mr7qd1KU3Z", "time": "2022-01-07 16:00:23+00:00"}, "1479206333354323976": {"text": "Today on @BNCNews I discussed my experience on Jan 6, 2021.\n\nSince that day, House Democrats have taken steps to protect our democracy including the passage of the John Lewis #VotingRightsAct. It’s now time for the Senate to do the same. https://t.co/ZdBq8efn9Q", "time": "2022-01-06 21:40:46+00:00"}, "1479092017267412997": {"text": "In the past year, we witnessed more coups worldwide than the previous 5 combined. If we fail to address the threats to our Democracy that Jan 6 put on display to the world, we risk losing not only our moral authority abroad, but our country itself. (12/12)", "time": "2022-01-06 14:06:31+00:00"}, "1479092015870660611": {"text": "To do that we must pass the #VotingRightsAct. Ensuring equitable access to the ballot box remains key. And as Chair of @HouseForeign, I’ll be leading efforts to promote Democracy globally. (11/12)", "time": "2022-01-06 14:06:31+00:00"}, "1479092014595690503": {"text": "As I reflect on that day, I’m more determined than ever to prevent another Nadir. The advancements we’ve made as a Nation, and as Black people, must be secured by renewing our commitment to Democracy and promoting racial equality. (10/12)", "time": "2022-01-06 14:06:31+00:00"}, "1479092012762767368": {"text": "Given this history, it only made sense that I would be bunkered in my office on January 6 with my Fraternity brother. That day the insurrectionists did more to remind us of our collective purpose in Congress than anything else; it was a call to social action. (9/12)", "time": "2022-01-06 14:06:30+00:00"}, "1479092011349295108": {"text": "Despite the grimness of the Nadir, Black institutions like @apa1906NETwork emerged as an act of resistance and source of refuge. Quoting one of our founders: “society offered us . . . no security. Out of our need, our Fraternity brought social purpose and social action.” (8/12)", "time": "2022-01-06 14:06:30+00:00"}, "1479092009684058113": {"text": "Lynchings and white supremacy were rampant, voting and political rights were denied, and Black codes were enacted forcing the formerly enslaved to choose between unfair labor conditions or jail.  The hopes and promises of Reconstruction were delayed. (7/12)", "time": "2022-01-06 14:06:29+00:00"}, "1479092007972880388": {"text": "Alpha emerged during a period of American history referred to as the “Nadir of American Race Relations” coined by historian Rayford Logan. It’s the period after Reconstruction where we saw significant backlash against efforts to ensure a healthy multi-racial Democracy. (6/12)", "time": "2022-01-06 14:06:29+00:00"}, "1479092006605533187": {"text": "Not only does @RepDavidScott share with me the honor of being the first Black Chairman of his Committee, we are both proud members of Alpha Phi Alpha Fraternity which was founded by Black students at Cornell in 1906 especially for moments like January 6.  (5/12)", "time": "2022-01-06 14:06:29+00:00"}, "1479092005292630018": {"text": "So, when I witnessed the insurrection from my office’s front row seat, I felt a profound sadness - yet, determination. As the violent crowd swelled before my eyes, I got a call from @RepDavidScott, who was seeking a safe refuge to shelter. (4/12)", "time": "2022-01-06 14:06:28+00:00"}, "1479092003065507843": {"text": "Buttressing @theBlackCaucus’ work are dozens of Black Subcommittee Chairs and other Members that represent Americans from rural communities to mega metropolises. The week of Jan 6 was indeed a watershed moment in Black political history. (3/12)", "time": "2022-01-06 14:06:28+00:00"}, "1479092001610031112": {"text": "The week of Jan 6, Congress certified the US’ resounding preference for @POTUS, and marked the swearing-in of the largest number of Black Members in our history. 6 are now Chairs of @FSCDems @HouseForeign @HouseAGDems @HouseScience @HomelandDems @EdLaborCmte (2/12)", "time": "2022-01-06 14:06:28+00:00"}, "1479091999772917762": {"text": "Jan. 6, 2021 began peacefully. As I viewed the Capitol Dome that morning, I reflected on all its history as a structure completed after the Civil War’s failed insurrection. Little did I know what started off as a calm morning would dissolve into another failed insurrection.(1/12)", "time": "2022-01-06 14:06:27+00:00"}, "1478822367610691584": {"text": "Proud to swear in my sister @CMAdrienneAdams, the FIRST Black woman to serve as Speaker of the New York City Council.\n\nThis is a historical moment for Queens, for New York City, and for our country.\nhttps://t.co/SnpFhrY5LZ", "time": "2022-01-05 20:15:02+00:00"}, "1477441612515090435": {"text": "Today members of the Haitian diaspora celebrate 218 years of freedom. \n\nHappy Independence Day to the world’s first Black republic!", "time": "2022-01-02 00:48:24+00:00"}, "1477313564968951809": {"text": "#HappyNewYear and welcome to 2022! Here’s to this being a year of growth and happiness for communities across our country. https://t.co/uGK0A52wMI", "time": "2022-01-01 16:19:35+00:00"}, "1476007808269271048": {"text": "My deepest condolences to the family and friends of Sen. Harry Reid. He truly fought the good fight. He was a master legislator and keen tactician; Americans to come will benefit from his life’s work.", "time": "2021-12-29 01:50:59+00:00"}, "1475152305297231874": {"text": "To observers, have a Joyous Kwanzaa! As we reflect on our Seven Principles, also remember our ancestors that continue to guide our steps. Let’s fulfill their greatest aspirations. https://t.co/tAY9psLFzp", "time": "2021-12-26 17:11:31+00:00"}, "1474753286804811780": {"text": "From my family to yours, Merry Christmas 🎄 and Happy Holidays! https://t.co/gvEhijbWEH", "time": "2021-12-25 14:45:57+00:00"}, "1474463068231016452": {"text": "Thank you @GovKathyHochul for expanding COVID-19 testing. We are seeing a rise in breakthrough cases. Getting tested can help protect your loved ones during the holidays.\n\nStarting 12/29 you can get free Covid tests at York College. Go to https://t.co/N97flXS8ch for more info", "time": "2021-12-24 19:32:44+00:00"}, "1474115621298360323": {"text": "Daunte Wright should still be here with us today. While his loved ones continue to mourn an immeasurable loss, I hope they find peace in today’s verdict. \n\nThe story of a Black American losing their life to police brutality is one we know too well and hear too often.", "time": "2021-12-23 20:32:06+00:00"}, "1473702808746614797": {"text": "The fact of the matter is the Dem. Party is the most forward-thinking. \n\nPolicies we’ve championed, though oft-mischaracterized by others, save lives and grow in demand. Let’s cut the noise, build on our accomplishments and #BuildBackBetter \n\nhttps://t.co/lyxilgWgRK", "time": "2021-12-22 17:11:44+00:00"}, "1473383672078385158": {"text": "Today, I joined a #NewDems letter to @SecRaimondo &amp; @AmbassadorTai urging them to expeditiously end Trump’s tariffs on alum./steel. This policy challenges our trade partnerships when cooperation is key towards promoting our shared interests, easing inflation, &amp; promoting growth https://t.co/iKPaM0P5mA", "time": "2021-12-21 20:03:36+00:00"}, "1473376504335720452": {"text": "We are seeing breakthrough cases all over the country and must take all precautions. For those of you who are eligible – get boosted! The only way to get through this pandemic is together. (2/2)", "time": "2021-12-21 19:35:07+00:00"}, "1473376502775529474": {"text": "The Omicron variant made it very clear that we are not yet out of the dark. Before seeing your loved ones, get vaccinated AND get a COVID test. Limit the size of your gatherings and if you can, social distance and wear a mask. (1/2)", "time": "2021-12-21 19:35:06+00:00"}, "1468704810631417856": {"text": "The future of innovation in the financial markets is inevitable.\n\nThe use of digital assets can help underserved communities access additional financial tools - but we must make sure there is global coordination around regulation. https://t.co/2DbvTZKMvp", "time": "2021-12-08 22:11:28+00:00"}, "1468336149479448580": {"text": "Today, we remember over 2,400 service members and civilians who were killed during the attack on Pearl Harbor.\n \nWe continue to honor their lives and commemorate the bravery and sacrifice of those who fought for our country in the days that followed. https://t.co/OwfvtrMjRI", "time": "2021-12-07 21:46:33+00:00"}, "1467136924733300748": {"text": "Happy 115th Founders’ Day to @apa1906NETwork. As Chair of @HouseForeign, I’ll make sure our collective commitment to service remains ALL inclusive and global.  🤙🏾 https://t.co/iWrvgBNKIn", "time": "2021-12-04 14:21:15+00:00"}, "1465690410257457156": {"text": "Omicron or Omarion, either way, please get vaxxed or boosted like you “Post to Be”.", "time": "2021-11-30 14:33:19+00:00"}, "1465101704295243780": {"text": "For those observing Hanukkah, may the lights of the menorah fill your home with brightness, and your hearts with hope and happiness as you celebrate with those you love. \n\nI wish you a #HappyHanukkah and your family a season of love, laughter and light. https://t.co/HVNR3PqnsI", "time": "2021-11-28 23:34:01+00:00"}, "1465094597785358339": {"text": "My deepest condolences to the Meek family. I had the honor of overlapping in Congressional service with Carrie Meek. \n\nAt her core, she was an educator and I’m thankful for all that I learned from her.", "time": "2021-11-28 23:05:46+00:00"}, "1463902323843948556": {"text": "From the Meeks family to yours, I hope everyone has a #HappyThanksgiving! Today we give thanks and gather with our family and friends to enjoy this beautiful holiday. https://t.co/IyhghM4YdB", "time": "2021-11-25 16:08:06+00:00"}, "1463599922482225163": {"text": "As Ahmaud Arbery’s family continues to grieve in his absence, I pray that they find some comfort in today’s verdict, though things will never be the same without him. \n\nI hope today’s verdict serves as a strong deterrent to those who find vigilantism and lynching acceptable.", "time": "2021-11-24 20:06:28+00:00"}, "1463555669311856650": {"text": "I commend @POTUS on moving forward with the historic nomination of Shalanda Young as OMB Director. Her bipartisan support and her ability to sift through the complexities of government makes her the best candidate for this role. https://t.co/EpjNWaMXay", "time": "2021-11-24 17:10:37+00:00"}, "1462801337104666629": {"text": "As @POTUS considers filling other Fed vacancies, diversity in background &amp; thought must be at the forefront. From dynamic labor leaders like @wspriggs to others, there are a plethora of qualified candidates that could help broaden the Fed’s perspective. (4/4)", "time": "2021-11-22 15:13:10+00:00"}, "1462801336072871940": {"text": "Further, Lael Brainard as Vice Chair is an excellent supervisory nomination. I had the benefit of working with her closely on CRA reform and I’m confident she will be a progressive force on banking regulation.  (3/4)", "time": "2021-11-22 15:13:10+00:00"}, "1462801335078817796": {"text": "As our country continues to navigate a pandemic economy, one where inflation has emerged as a new challenge, Powell will be a steady hand that promotes stability during uncertain times. (2/4)", "time": "2021-11-22 15:13:10+00:00"}, "1462801333552099332": {"text": "President Biden’s nomination of Jerome Powell to continue as Fed Chair, and Lael Brainard as Vice Chair is appropriate. (1/4)", "time": "2021-11-22 15:13:10+00:00"}, "1461783851177500672": {"text": "Let us not forget that two people died unnecessarily, one injured, and their families are left behind with today’s judgment, but no recourse. \n\nRittenhouse was never the victim here - those making him out to be a hero are degenerates.\n\nhttps://t.co/bqrRP4xYZl", "time": "2021-11-19 19:50:03+00:00"}, "1461710107893542912": {"text": "As someone who grew up in NYCHA, I’m mostly looking forward to the approx $40 billion towards @NYCHA Housing that will address repairs and affordable housing for families in NYC. \n\nI look forward to the bill’s passage in the Senate and its signage into law.", "time": "2021-11-19 14:57:01+00:00"}, "1461710106601701380": {"text": "Today @HouseDemocrats passed the #BuildBackBetter Act which will deliver: \n\n✅ universal pre-k\n✅ healthcare \n✅ affordable housing\n✅ lower Rx drug costs\n✅ climate action \n✅ millions of jobs", "time": "2021-11-19 14:57:01+00:00"}, "1461489506230677510": {"text": "Looking forward to doing our part in the House and advancing the #BuildBackBetter Act! https://t.co/Dq0qHA8ViP", "time": "2021-11-19 00:20:26+00:00"}, "1458785848833593345": {"text": "This #VeteransDay, we celebrate and honor the millions of men and women who have served our country. \n\nWe thank you for your service today and every day. https://t.co/JKoMpEba7b", "time": "2021-11-11 13:17:03+00:00"}, "1458536181726158853": {"text": "Happy 246th Birthday, @USMC\n\nToday and every day, we recognize the men and women of the Marine Corps and the time spent serving our country. Thank you for your bravery and dedication! https://t.co/6BzqyQqDJG", "time": "2021-11-10 20:44:58+00:00"}, "1456837363926282245": {"text": "The $1.2 trillion Bipartisan Infrastructure Bill has just passed the House! \n\nI look forward to @POTUS signing the Bipartisan Infrastructure Bill into law and working with my colleagues to pass the #BuildBackBetter Act!", "time": "2021-11-06 04:14:28+00:00"}, "1456722337395613700": {"text": "#OTD 53 years ago, Shirley Chisholm became the first Black woman elected to Congress, and later, the first black candidate to run for President of the United States. \n\nToday, we celebrate her and how her victory has inspired women and African Americans for generations to come. https://t.co/dnr7EwyVKJ", "time": "2021-11-05 20:37:24+00:00"}, "1456274416967438338": {"text": "I’m proud to support @RepMaloney’s resolution to make Diwali a federal holiday.\n\nFor those celebrating, I hope the Diwali lights brighten your life and fill your day with happiness.\n\nHave a blessed #Diwali https://t.co/ASZk5bzw8N", "time": "2021-11-04 14:57:31+00:00"}}